# Function Application

To apply your own or another libraryâ€™s functions to Pandas objects, you should be aware of the three important methods.  
- Table wise Function Application: `pipe()`
- Row or Column Wise Function Application: `apply()`
- Element wise Function Application: `applymap()`

The appropriate method to use depends on whether your function expects to operate on an entire DataFrame, row or column-wise, or element wise.

In [1]:
import numpy as np
import pandas as pd

Defining a function for adding two elements:

In [2]:
def add2(elem1, elem2):
    '''
    Add two numbers
    '''
    return(elem1 + elem2)

Creating a DataFrame df:

In [3]:
df = pd.DataFrame({'Col1':[1,1,1,1],'Col2':[1,2,3,4],'Col3':[-1,0,1,2]})
df

   Col1  Col2  Col3
0     1     1    -1
1     1     2     0
2     1     3     1
3     1     4     2

## Table-wise Function Application

**Table-wise Function Application**: Custom operations can be performed by passing the function and the appropriate number of parameters as pipe arguments. Thus, operation is performed on the whole DataFrame.

`pipe()` function performs the custom operation for the entire DataFrame. 

In below example we will using `pipe()` function to add value 5 to the entire dataframe

In [4]:
df.pipe(add2,5)

   Col1  Col2  Col3
0     6     6     4
1     6     7     5
2     6     8     6
3     6     9     7

`df.pipe` does not affect the original DataFrame `df`

In [5]:
df

   Col1  Col2  Col3
0     1     1    -1
1     1     2     0
2     1     3     1
3     1     4     2

In [6]:
df2 = df.pipe(add2,10)
df2

   Col1  Col2  Col3
0    11    11     9
1    11    12    10
2    11    13    11
3    11    14    12

## Row or Column Wise Function Application

`apply()` function performs the custom operation for either row wise or column wise.

Calculating mean by columns

In [7]:
df.apply(np.mean)

Col1    1.0
Col2    2.5
Col3    0.5
dtype: float64

You can calculate the mean by columns without the apply function

In [8]:
df.mean()

Col1    1.0
Col2    2.5
Col3    0.5
dtype: float64

Let's define a function that calculates the sum of the squares values of a list.

In [9]:
def sum_squares(l):
    '''
    Return the sum of squares of the list
    '''
    return(sum(x**2 for x in l))

In [10]:
df.apply(sum_squares)

Col1     4
Col2    30
Col3     6
dtype: int64

The parameter axis=0 gives the same result

In [11]:
df.apply(sum_squares, axis=0)

Col1     4
Col2    30
Col3     6
dtype: int64

Using the parameter `axis=1`, operations will be performed row wise.

In [12]:
df.apply(sum_squares,axis=1)

0     3
1     5
2    11
3    21
dtype: int64

We can create a lambda function to determine the range = max - min by column:

In [13]:
display(df)
df.apply(lambda x: x.max()-x.min())

   Col1  Col2  Col3
0     1     1    -1
1     1     2     0
2     1     3     1
3     1     4     2

Col1    0
Col2    3
Col3    3
dtype: int64

or by row (specifying axis=1)

In [14]:
df.apply(lambda x: x.max()-x.min(), axis=1)

0    2
1    2
2    2
3    3
dtype: int64

## Element Wise Function Application

`applymap()` function performs the specified operation for all the elements the dataframe.

Let's use a lambda function to multiply every element in the dataframe by 100

In [15]:
display(df)
df.applymap(lambda x: x*100)

   Col1  Col2  Col3
0     1     1    -1
1     1     2     0
2     1     3     1
3     1     4     2

   Col1  Col2  Col3
0   100   100  -100
1   100   200     0
2   100   300   100
3   100   400   200

Combining multiple functions

In [16]:
df.applymap(lambda x: x*100).apply(np.mean)

Col1    100.0
Col2    250.0
Col3     50.0
dtype: float64

`map()` is used to substitute each value in a Series with another value.

Let's use the `map()` function over the Serie: Col1.

In [17]:
display(df.Col1)
df.Col1.map(lambda x: x*100)

0    1
1    1
2    1
3    1
Name: Col1, dtype: int64

0    100
1    100
2    100
3    100
Name: Col1, dtype: int64

Let's use `pipe()` to do the same over the whole DataFrame.

In [18]:
df.pipe(lambda x: x*100)

   Col1  Col2  Col3
0   100   100  -100
1   100   200     0
2   100   300   100
3   100   400   200

Remember those function applications do not modify the original DataFrame `df`

In [19]:
display(df)

   Col1  Col2  Col3
0     1     1    -1
1     1     2     0
2     1     3     1
3     1     4     2

## Iterations

The behavior of basic iteration over Pandas objects depends on the type. 

When iterating over a Series, it is regarded as array-like, and basic iteration produces the values. 

Other data structures, like DataFrames, follow the dict-like convention of iterating over the keys of the objects.

In [20]:
N = 3

In [21]:
dfi = pd.DataFrame({
   'A': pd.date_range(start='2021-02-15',periods=N,freq='D'),
   'B': np.linspace(0,stop=N-1,num=N),
   'C': np.random.rand(N),
   'D': np.random.choice(['Low','Medium','High'],N).tolist(),
   'E': np.random.normal(100, 10, size=(N)).tolist()
})
df.head()

   Col1  Col2  Col3
0     1     1    -1
1     1     2     0
2     1     3     1
3     1     4     2

In [22]:
dfi = pd.DataFrame({
   'Date': pd.date_range(start='2022-05-15',periods=N,freq='D'),
   'Values': np.linspace(0,stop=N-1,num=N),
   'Categ': np.random.choice(['Low','Medium','High'],N).tolist()
})
dfi.head()

        Date  Values   Categ
0 2022-05-15     0.0    High
1 2022-05-16     1.0     Low
2 2022-05-17     2.0  Medium

In [23]:
# Getting the names of the columns
for col in dfi:
    print(col)

Date
Values
Categ

To iterate over the rows of the DataFrame, we can use the following functions:
- `items()`: to iterate over the (key,value) pairs
- `iterrows()`: iterate over the rows as (index,series) pairs
- `itertuples()`: iterate over the rows as namedtuples

`items()`: Iterates over each column as key, and column value as a Series object.

In [24]:
for key,value in dfi.items():
   print('\nKey =', key)
   print('Value =\n',value)

Key = Date
Value =
 0   2022-05-15
1   2022-05-16
2   2022-05-17
Name: Date, dtype: datetime64[ns]

Key = Values
Value =
 0    0.0
1    1.0
2    2.0
Name: Values, dtype: float64

Key = Categ
Value =
 0      High
1       Low
2    Medium
Name: Categ, dtype: object

`iterrows()`: returns the iterator yielding each index value along with a series containing the data in each row.

In [25]:
for row in dfi.iterrows():
   print(row,'\n')

(0, Date      2022-05-15 00:00:00
Values                    0.0
Categ                    High
Name: 0, dtype: object)

(1, Date      2022-05-16 00:00:00
Values                    1.0
Categ                     Low
Name: 1, dtype: object)

(2, Date      2022-05-17 00:00:00
Values                    2.0
Categ                  Medium
Name: 2, dtype: object)

`itertuples()`:  returns an iterator yielding a named tuple for each row in the DataFrame. The first element of the tuple will be the rowâ€™s corresponding index value, while the remaining values are the row values. To preserve dtypes while iterating over the rows, it is better to use itertuples()

In [26]:
for row in dfi.itertuples():
    print(row,'\n')

Pandas(Index=0, Date=Timestamp('2022-05-15 00:00:00'), Values=0.0, Categ='High')

Pandas(Index=1, Date=Timestamp('2022-05-16 00:00:00'), Values=1.0, Categ='Low')

Pandas(Index=2, Date=Timestamp('2022-05-17 00:00:00'), Values=2.0, Categ='Medium')

## Sorting

There are two kinds of sorting available in Pandas: by label and by actual values.

In [27]:
unsorted_df=pd.DataFrame({
    'Z': np.random.randint(0, 5, size=10),
    'A': np.random.randint(2, 5, size=10),
    'K': np.random.randint(1, 8, size=10)},
    index=[1, 4, 6, 2, 3, 5, 9, 8, 0, 7])    
unsorted_df

   Z  A  K
1  0  2  2
4  0  4  5
6  4  3  2
2  3  3  2
3  0  2  3
5  0  2  1
9  0  3  2
8  4  2  5
0  3  4  2
7  0  3  2

Sorting by label

In [28]:
unsorted_df.sort_index()

   Z  A  K
0  3  4  2
1  0  2  2
2  3  3  2
3  0  2  3
4  0  4  5
5  0  2  1
6  4  3  2
7  0  3  2
8  4  2  5
9  0  3  2

Sorting labels in descending order

In [29]:
unsorted_df.sort_index(ascending=False)

   Z  A  K
9  0  3  2
8  4  2  5
7  0  3  2
6  4  3  2
5  0  2  1
4  0  4  5
3  0  2  3
2  3  3  2
1  0  2  2
0  3  4  2

Sort the column names

In [30]:
unsorted_df.sort_index(axis=1)

   A  K  Z
1  2  2  0
4  4  5  0
6  3  2  4
2  3  2  3
3  2  3  0
5  2  1  0
9  3  2  0
8  2  5  4
0  4  2  3
7  3  2  0

Sort the column names in descending order

In [31]:
unsorted_df.sort_index(axis=1, ascending=False)

   Z  K  A
1  0  2  2
4  0  5  4
6  4  2  3
2  3  2  3
3  0  3  2
5  0  1  2
9  0  2  3
8  4  5  2
0  3  2  4
7  0  2  3

**Sorting by value**

Sorting values by column Z

In [32]:
unsorted_df.sort_values(by='Z')

   Z  A  K
1  0  2  2
4  0  4  5
3  0  2  3
5  0  2  1
9  0  3  2
7  0  3  2
2  3  3  2
0  3  4  2
6  4  3  2
8  4  2  5

Sorting values by columns Z and A

In [33]:
unsorted_df.sort_values(by=['Z','A'])

   Z  A  K
1  0  2  2
3  0  2  3
5  0  2  1
9  0  3  2
7  0  3  2
4  0  4  5
2  3  3  2
0  3  4  2
8  4  2  5
6  4  3  2

## References

- VanderPlas, J. (2017) Python Data Science Handbook: Essential Tools for Working with Data. USA: Oâ€™Reilly Media, Inc. chapter 3